Repository: CofficLab/Lumi
Catalog: Packages/PluginHostsManager/Sources/PluginHostsManager/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add Host Entry
zh_hans: 添加主机条目
zh_hk: 添加主機條目

source: Add sheet: 「Add Host Entry」 with the 「IP Address」, 「Domain」, 「Comment」, and 「Group」 fields.
zh_hans: 添加面板：「添加主机条目」包含「IP 地址」「域名」「备注」「分组」字段。
zh_hk: 新增面板：「添加主機條目」包含「IP 位址」「網域」「備註」「分組」欄位。

source: All
zh_hans: 全部
zh_hk: 全部

source: Allows adding, editing, and removing entries
zh_hans: 支持添加、编辑和删除条目
zh_hk: 支援新增、編輯和刪除條目

source: Backup your hosts file before making changes
zh_hans: 修改前请备份 hosts 文件
zh_hk: 修改前請備份 hosts 檔案

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Changes are written to the system hosts file and take effect in DNS resolution immediately.
zh_hans: 更改会写入系统 hosts 文件，并立即生效于 DNS 解析。
zh_hk: 變更會寫入系統 hosts 檔案，並立即生效於 DNS 解析。

source: Choose 「Export Backup...」 from the 「More」 menu to save a backup, or 「Import Backup...」 to restore one.
zh_hans: 从「更多」菜单选择「导出备份...」以保存备份，或选择「导入备份...」以恢复。
zh_hk: 從「更多」選單選擇「匯出備份...」以保存備份，或選擇「匯入備份...」以復原。

source: Click 「Add」; in the 「Add Host Entry」 sheet, fill in 「IP Address」 and 「Domain」, optionally 「Comment」 and 「Group」, then click 「Save」.
zh_hans: 点击「添加」；在「添加主机条目」面板中填写「IP 地址」与「域名」，可选填「备注」与「分组」，然后点击「保存」。
zh_hk: 點擊「新增」；在「添加主機條目」面板中填寫「IP 位址」與「網域」，可選填「備註」與「分組」，然後點擊「儲存」。

source: Click the trash button on an entry to remove it.
zh_hans: 点击条目上的删除按钮即可移除该条目。
zh_hk: 點擊條目上的刪除按鈕即可移除該條目。

source: Comment
zh_hans: 备注
zh_hk: 備註

source: Comments start with # and are ignored
zh_hans: 以 # 开头的行是注释，会被忽略
zh_hk: 以 # 開頭的行是註解，會被忽略

source: Create and switch between different hosts profiles
zh_hans: 创建并切换不同的 hosts 配置文件
zh_hk: 建立並切換不同的 hosts 設定檔

source: Disable critical entries with care; some system services may fail to resolve.
zh_hans: 谨慎停用关键条目；部分系统服务可能无法解析。
zh_hk: 謹慎停用關鍵條目；部分系統服務可能無法解析。

source: Domain
zh_hans: 域名
zh_hk: 網域

source: Edit and manage the system hosts file with a user-friendly interface
zh_hans: 通过友好界面编辑和管理系统 hosts 文件
zh_hk: 透過友善介面編輯和管理系統 hosts 檔案

source: Enable or disable hosts entries without deleting them
zh_hans: 无需删除即可启用或禁用 hosts 条目
zh_hk: 無需刪除即可啟用或停用 hosts 條目

source: Entry list
zh_hans: 条目列表
zh_hk: 條目列表

source: Entry list: entries grouped by group; each entry shows an enable toggle, its domains and comment, the IP address in monospaced text, and a trash button.
zh_hans: 条目列表：条目按分组归类；每个条目显示启用开关、域名与备注、等宽字体的 IP 地址，以及删除按钮。
zh_hk: 條目列表：條目按分組歸類；每個條目顯示啟用開關、網域與備註、等寬字體的 IP 位址，以及刪除按鈕。

source: Export a backup before making large changes.
zh_hans: 进行大量更改前，请先导出备份。
zh_hk: 進行大量變更前，請先匯出備份。

source: Export Backup...
zh_hans: 导出备份...
zh_hk: 匯出備份...

source: Export failed: %@
zh_hans: 导出失败：%@
zh_hk: 匯出失敗：%@

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面佈局

source: Group
zh_hans: 分组
zh_hk: 分组

source: Hosts File Management
zh_hans: Hosts 文件管理
zh_hk: Hosts 檔案管理

source: Hosts Manager
zh_hans: Hosts 管理器
zh_hk: Hosts 管理器

source: Import Backup...
zh_hans: 导入备份...
zh_hk: 匯入備份...

source: Import failed: %@
zh_hans: 导入失败：%@
zh_hk: 匯入失敗：%@

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Invalid domain format
zh_hans: 域名格式无效
zh_hk: 域名格式无效

source: Invalid IP address format
zh_hans: IP 地址格式无效
zh_hk: IP 地址格式无效

source: Invalid IP addresses or domain names are rejected by validation and cannot be saved.
zh_hans: 无效的 IP 地址或域名会被校验拦截，无法保存。
zh_hk: 無效的 IP 位址或網域名稱會被校驗攔截，無法儲存。

source: IP Address
zh_hans: IP 地址
zh_hk: IP 位址

source: Loading Hosts
zh_hans: 加载 Hosts
zh_hk: 加载 Hosts

source: More
zh_hans: 更多
zh_hk: 更多

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Open the Hosts Manager tab in the sidebar.
zh_hans: 在侧边栏中打开「Hosts 管理器」标签页。
zh_hk: 在側邊欄中開啟「Hosts 管理器」標籤頁。

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Parses and displays entries in an organized list
zh_hans: 解析并以有序列表显示条目
zh_hk: 解析並以有序列表顯示條目

source: Profile Support
zh_hans: 配置文件支持
zh_hk: 設定檔支援

source: Quick Toggle
zh_hans: 快速开关
zh_hk: 快速開關

source: Reads the system hosts file with proper permissions
zh_hans: 以适当权限读取系统 hosts 文件
zh_hk: 以適當權限讀取系統 hosts 檔案

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Retry
zh_hans: 重试
zh_hk: 重試

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Search Host
zh_hans: 搜索主机
zh_hk: 搜索主机

source: Syntax Highlighting
zh_hans: 语法高亮
zh_hk: 語法醒目提示

source: Syntax highlighting and validation for hosts entries
zh_hans: 为 hosts 条目提供语法高亮和校验
zh_hk: 為 hosts 條目提供語法醒目提示和驗證

source: This manual covers the interface and basic operations of the Hosts Manager: adding, toggling, searching, and backing up hosts entries.
zh_hans: 本手册介绍「Hosts 管理器」的界面与基本操作：添加、开关、搜索以及备份 hosts 条目。
zh_hk: 本手冊介紹「Hosts 管理器」的介面與基本操作：新增、開關、搜尋以及備份 hosts 條目。

source: Toolbar
zh_hans: 工具栏
zh_hk: 工具列

source: Toolbar: a group picker, the 「Search Host」 field, the 「Add」 button, and a 「More」 menu with 「Refresh」, 「Export Backup...」, and 「Import Backup...」.
zh_hans: 工具栏：分组选择器、「搜索主机」输入框、「添加」按钮，以及包含「刷新」「导出备份...」「导入备份...」的「更多」菜单。
zh_hk: 工具列：分組選擇器、「搜索主机」輸入框、「新增」按鈕，以及包含「重新整理」「匯出備份...」「匯入備份...」的「更多」選單。

source: Type in 「Search Host」 or pick a group in the group picker to filter the list.
zh_hans: 在「搜索主机」中输入文字，或在分组选择器中选择分组以筛选列表。
zh_hk: 在「搜索主机」中輸入文字，或在分組選擇器中選擇分組以篩選列表。

source: Use profiles to switch between different configurations
zh_hans: 使用配置文件在不同配置间切换
zh_hk: 使用設定檔在不同配置間切換

source: Use the toggle on an entry to enable or disable it without deleting it.
zh_hans: 使用条目上的开关可启用或停用条目，而不会删除它。
zh_hk: 使用條目上的開關可啟用或停用條目，而不會刪除它。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Writes changes back to the hosts file
zh_hans: 将更改写回 hosts 文件
zh_hk: 將變更寫回 hosts 檔案
